// Generated by jextract

package tech.bitey.golpanama.xlib;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
/**
 * {@snippet :
 * union _XEvent {
 *     int type;
 *     XAnyEvent xany;
 *     XKeyEvent xkey;
 *     XButtonEvent xbutton;
 *     XMotionEvent xmotion;
 *     XCrossingEvent xcrossing;
 *     XFocusChangeEvent xfocus;
 *     XExposeEvent xexpose;
 *     XGraphicsExposeEvent xgraphicsexpose;
 *     XNoExposeEvent xnoexpose;
 *     XVisibilityEvent xvisibility;
 *     XCreateWindowEvent xcreatewindow;
 *     XDestroyWindowEvent xdestroywindow;
 *     XUnmapEvent xunmap;
 *     XMapEvent xmap;
 *     XMapRequestEvent xmaprequest;
 *     XReparentEvent xreparent;
 *     XConfigureEvent xconfigure;
 *     XGravityEvent xgravity;
 *     XResizeRequestEvent xresizerequest;
 *     XConfigureRequestEvent xconfigurerequest;
 *     XCirculateEvent xcirculate;
 *     XCirculateRequestEvent xcirculaterequest;
 *     XPropertyEvent xproperty;
 *     XSelectionClearEvent xselectionclear;
 *     XSelectionRequestEvent xselectionrequest;
 *     XSelectionEvent xselection;
 *     XColormapEvent xcolormap;
 *     XClientMessageEvent xclient;
 *     XMappingEvent xmapping;
 *     XErrorEvent xerror;
 *     XKeymapEvent xkeymap;
 *     XGenericEvent xgeneric;
 *     XGenericEventCookie xcookie;
 *     long pad[24];
 * };
 * }
 */
public class _XEvent {

    static final UnionLayout $union$LAYOUT = MemoryLayout.unionLayout(
        Constants$root.C_INT$LAYOUT.withName("type"),
        MemoryLayout.structLayout(
            Constants$root.C_INT$LAYOUT.withName("type"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_LONG_LONG$LAYOUT.withName("serial"),
            Constants$root.C_INT$LAYOUT.withName("send_event"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_POINTER$LAYOUT.withName("display"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("window")
        ).withName("xany"),
        MemoryLayout.structLayout(
            Constants$root.C_INT$LAYOUT.withName("type"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_LONG_LONG$LAYOUT.withName("serial"),
            Constants$root.C_INT$LAYOUT.withName("send_event"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_POINTER$LAYOUT.withName("display"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("window"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("root"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("subwindow"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("time"),
            Constants$root.C_INT$LAYOUT.withName("x"),
            Constants$root.C_INT$LAYOUT.withName("y"),
            Constants$root.C_INT$LAYOUT.withName("x_root"),
            Constants$root.C_INT$LAYOUT.withName("y_root"),
            Constants$root.C_INT$LAYOUT.withName("state"),
            Constants$root.C_INT$LAYOUT.withName("keycode"),
            Constants$root.C_INT$LAYOUT.withName("same_screen"),
            MemoryLayout.paddingLayout(32)
        ).withName("xkey"),
        MemoryLayout.structLayout(
            Constants$root.C_INT$LAYOUT.withName("type"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_LONG_LONG$LAYOUT.withName("serial"),
            Constants$root.C_INT$LAYOUT.withName("send_event"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_POINTER$LAYOUT.withName("display"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("window"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("root"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("subwindow"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("time"),
            Constants$root.C_INT$LAYOUT.withName("x"),
            Constants$root.C_INT$LAYOUT.withName("y"),
            Constants$root.C_INT$LAYOUT.withName("x_root"),
            Constants$root.C_INT$LAYOUT.withName("y_root"),
            Constants$root.C_INT$LAYOUT.withName("state"),
            Constants$root.C_INT$LAYOUT.withName("button"),
            Constants$root.C_INT$LAYOUT.withName("same_screen"),
            MemoryLayout.paddingLayout(32)
        ).withName("xbutton"),
        MemoryLayout.structLayout(
            Constants$root.C_INT$LAYOUT.withName("type"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_LONG_LONG$LAYOUT.withName("serial"),
            Constants$root.C_INT$LAYOUT.withName("send_event"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_POINTER$LAYOUT.withName("display"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("window"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("root"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("subwindow"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("time"),
            Constants$root.C_INT$LAYOUT.withName("x"),
            Constants$root.C_INT$LAYOUT.withName("y"),
            Constants$root.C_INT$LAYOUT.withName("x_root"),
            Constants$root.C_INT$LAYOUT.withName("y_root"),
            Constants$root.C_INT$LAYOUT.withName("state"),
            Constants$root.C_CHAR$LAYOUT.withName("is_hint"),
            MemoryLayout.paddingLayout(24),
            Constants$root.C_INT$LAYOUT.withName("same_screen"),
            MemoryLayout.paddingLayout(32)
        ).withName("xmotion"),
        MemoryLayout.structLayout(
            Constants$root.C_INT$LAYOUT.withName("type"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_LONG_LONG$LAYOUT.withName("serial"),
            Constants$root.C_INT$LAYOUT.withName("send_event"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_POINTER$LAYOUT.withName("display"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("window"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("root"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("subwindow"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("time"),
            Constants$root.C_INT$LAYOUT.withName("x"),
            Constants$root.C_INT$LAYOUT.withName("y"),
            Constants$root.C_INT$LAYOUT.withName("x_root"),
            Constants$root.C_INT$LAYOUT.withName("y_root"),
            Constants$root.C_INT$LAYOUT.withName("mode"),
            Constants$root.C_INT$LAYOUT.withName("detail"),
            Constants$root.C_INT$LAYOUT.withName("same_screen"),
            Constants$root.C_INT$LAYOUT.withName("focus"),
            Constants$root.C_INT$LAYOUT.withName("state"),
            MemoryLayout.paddingLayout(32)
        ).withName("xcrossing"),
        MemoryLayout.structLayout(
            Constants$root.C_INT$LAYOUT.withName("type"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_LONG_LONG$LAYOUT.withName("serial"),
            Constants$root.C_INT$LAYOUT.withName("send_event"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_POINTER$LAYOUT.withName("display"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("window"),
            Constants$root.C_INT$LAYOUT.withName("mode"),
            Constants$root.C_INT$LAYOUT.withName("detail")
        ).withName("xfocus"),
        MemoryLayout.structLayout(
            Constants$root.C_INT$LAYOUT.withName("type"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_LONG_LONG$LAYOUT.withName("serial"),
            Constants$root.C_INT$LAYOUT.withName("send_event"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_POINTER$LAYOUT.withName("display"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("window"),
            Constants$root.C_INT$LAYOUT.withName("x"),
            Constants$root.C_INT$LAYOUT.withName("y"),
            Constants$root.C_INT$LAYOUT.withName("width"),
            Constants$root.C_INT$LAYOUT.withName("height"),
            Constants$root.C_INT$LAYOUT.withName("count"),
            MemoryLayout.paddingLayout(32)
        ).withName("xexpose"),
        MemoryLayout.structLayout(
            Constants$root.C_INT$LAYOUT.withName("type"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_LONG_LONG$LAYOUT.withName("serial"),
            Constants$root.C_INT$LAYOUT.withName("send_event"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_POINTER$LAYOUT.withName("display"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("drawable"),
            Constants$root.C_INT$LAYOUT.withName("x"),
            Constants$root.C_INT$LAYOUT.withName("y"),
            Constants$root.C_INT$LAYOUT.withName("width"),
            Constants$root.C_INT$LAYOUT.withName("height"),
            Constants$root.C_INT$LAYOUT.withName("count"),
            Constants$root.C_INT$LAYOUT.withName("major_code"),
            Constants$root.C_INT$LAYOUT.withName("minor_code"),
            MemoryLayout.paddingLayout(32)
        ).withName("xgraphicsexpose"),
        MemoryLayout.structLayout(
            Constants$root.C_INT$LAYOUT.withName("type"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_LONG_LONG$LAYOUT.withName("serial"),
            Constants$root.C_INT$LAYOUT.withName("send_event"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_POINTER$LAYOUT.withName("display"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("drawable"),
            Constants$root.C_INT$LAYOUT.withName("major_code"),
            Constants$root.C_INT$LAYOUT.withName("minor_code")
        ).withName("xnoexpose"),
        MemoryLayout.structLayout(
            Constants$root.C_INT$LAYOUT.withName("type"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_LONG_LONG$LAYOUT.withName("serial"),
            Constants$root.C_INT$LAYOUT.withName("send_event"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_POINTER$LAYOUT.withName("display"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("window"),
            Constants$root.C_INT$LAYOUT.withName("state"),
            MemoryLayout.paddingLayout(32)
        ).withName("xvisibility"),
        MemoryLayout.structLayout(
            Constants$root.C_INT$LAYOUT.withName("type"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_LONG_LONG$LAYOUT.withName("serial"),
            Constants$root.C_INT$LAYOUT.withName("send_event"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_POINTER$LAYOUT.withName("display"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("parent"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("window"),
            Constants$root.C_INT$LAYOUT.withName("x"),
            Constants$root.C_INT$LAYOUT.withName("y"),
            Constants$root.C_INT$LAYOUT.withName("width"),
            Constants$root.C_INT$LAYOUT.withName("height"),
            Constants$root.C_INT$LAYOUT.withName("border_width"),
            Constants$root.C_INT$LAYOUT.withName("override_redirect")
        ).withName("xcreatewindow"),
        MemoryLayout.structLayout(
            Constants$root.C_INT$LAYOUT.withName("type"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_LONG_LONG$LAYOUT.withName("serial"),
            Constants$root.C_INT$LAYOUT.withName("send_event"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_POINTER$LAYOUT.withName("display"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("event"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("window")
        ).withName("xdestroywindow"),
        MemoryLayout.structLayout(
            Constants$root.C_INT$LAYOUT.withName("type"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_LONG_LONG$LAYOUT.withName("serial"),
            Constants$root.C_INT$LAYOUT.withName("send_event"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_POINTER$LAYOUT.withName("display"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("event"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("window"),
            Constants$root.C_INT$LAYOUT.withName("from_configure"),
            MemoryLayout.paddingLayout(32)
        ).withName("xunmap"),
        MemoryLayout.structLayout(
            Constants$root.C_INT$LAYOUT.withName("type"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_LONG_LONG$LAYOUT.withName("serial"),
            Constants$root.C_INT$LAYOUT.withName("send_event"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_POINTER$LAYOUT.withName("display"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("event"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("window"),
            Constants$root.C_INT$LAYOUT.withName("override_redirect"),
            MemoryLayout.paddingLayout(32)
        ).withName("xmap"),
        MemoryLayout.structLayout(
            Constants$root.C_INT$LAYOUT.withName("type"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_LONG_LONG$LAYOUT.withName("serial"),
            Constants$root.C_INT$LAYOUT.withName("send_event"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_POINTER$LAYOUT.withName("display"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("parent"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("window")
        ).withName("xmaprequest"),
        MemoryLayout.structLayout(
            Constants$root.C_INT$LAYOUT.withName("type"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_LONG_LONG$LAYOUT.withName("serial"),
            Constants$root.C_INT$LAYOUT.withName("send_event"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_POINTER$LAYOUT.withName("display"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("event"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("window"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("parent"),
            Constants$root.C_INT$LAYOUT.withName("x"),
            Constants$root.C_INT$LAYOUT.withName("y"),
            Constants$root.C_INT$LAYOUT.withName("override_redirect"),
            MemoryLayout.paddingLayout(32)
        ).withName("xreparent"),
        MemoryLayout.structLayout(
            Constants$root.C_INT$LAYOUT.withName("type"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_LONG_LONG$LAYOUT.withName("serial"),
            Constants$root.C_INT$LAYOUT.withName("send_event"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_POINTER$LAYOUT.withName("display"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("event"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("window"),
            Constants$root.C_INT$LAYOUT.withName("x"),
            Constants$root.C_INT$LAYOUT.withName("y"),
            Constants$root.C_INT$LAYOUT.withName("width"),
            Constants$root.C_INT$LAYOUT.withName("height"),
            Constants$root.C_INT$LAYOUT.withName("border_width"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_LONG_LONG$LAYOUT.withName("above"),
            Constants$root.C_INT$LAYOUT.withName("override_redirect"),
            MemoryLayout.paddingLayout(32)
        ).withName("xconfigure"),
        MemoryLayout.structLayout(
            Constants$root.C_INT$LAYOUT.withName("type"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_LONG_LONG$LAYOUT.withName("serial"),
            Constants$root.C_INT$LAYOUT.withName("send_event"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_POINTER$LAYOUT.withName("display"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("event"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("window"),
            Constants$root.C_INT$LAYOUT.withName("x"),
            Constants$root.C_INT$LAYOUT.withName("y")
        ).withName("xgravity"),
        MemoryLayout.structLayout(
            Constants$root.C_INT$LAYOUT.withName("type"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_LONG_LONG$LAYOUT.withName("serial"),
            Constants$root.C_INT$LAYOUT.withName("send_event"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_POINTER$LAYOUT.withName("display"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("window"),
            Constants$root.C_INT$LAYOUT.withName("width"),
            Constants$root.C_INT$LAYOUT.withName("height")
        ).withName("xresizerequest"),
        MemoryLayout.structLayout(
            Constants$root.C_INT$LAYOUT.withName("type"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_LONG_LONG$LAYOUT.withName("serial"),
            Constants$root.C_INT$LAYOUT.withName("send_event"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_POINTER$LAYOUT.withName("display"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("parent"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("window"),
            Constants$root.C_INT$LAYOUT.withName("x"),
            Constants$root.C_INT$LAYOUT.withName("y"),
            Constants$root.C_INT$LAYOUT.withName("width"),
            Constants$root.C_INT$LAYOUT.withName("height"),
            Constants$root.C_INT$LAYOUT.withName("border_width"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_LONG_LONG$LAYOUT.withName("above"),
            Constants$root.C_INT$LAYOUT.withName("detail"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_LONG_LONG$LAYOUT.withName("value_mask")
        ).withName("xconfigurerequest"),
        MemoryLayout.structLayout(
            Constants$root.C_INT$LAYOUT.withName("type"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_LONG_LONG$LAYOUT.withName("serial"),
            Constants$root.C_INT$LAYOUT.withName("send_event"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_POINTER$LAYOUT.withName("display"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("event"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("window"),
            Constants$root.C_INT$LAYOUT.withName("place"),
            MemoryLayout.paddingLayout(32)
        ).withName("xcirculate"),
        MemoryLayout.structLayout(
            Constants$root.C_INT$LAYOUT.withName("type"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_LONG_LONG$LAYOUT.withName("serial"),
            Constants$root.C_INT$LAYOUT.withName("send_event"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_POINTER$LAYOUT.withName("display"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("parent"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("window"),
            Constants$root.C_INT$LAYOUT.withName("place"),
            MemoryLayout.paddingLayout(32)
        ).withName("xcirculaterequest"),
        MemoryLayout.structLayout(
            Constants$root.C_INT$LAYOUT.withName("type"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_LONG_LONG$LAYOUT.withName("serial"),
            Constants$root.C_INT$LAYOUT.withName("send_event"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_POINTER$LAYOUT.withName("display"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("window"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("atom"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("time"),
            Constants$root.C_INT$LAYOUT.withName("state"),
            MemoryLayout.paddingLayout(32)
        ).withName("xproperty"),
        MemoryLayout.structLayout(
            Constants$root.C_INT$LAYOUT.withName("type"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_LONG_LONG$LAYOUT.withName("serial"),
            Constants$root.C_INT$LAYOUT.withName("send_event"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_POINTER$LAYOUT.withName("display"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("window"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("selection"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("time")
        ).withName("xselectionclear"),
        MemoryLayout.structLayout(
            Constants$root.C_INT$LAYOUT.withName("type"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_LONG_LONG$LAYOUT.withName("serial"),
            Constants$root.C_INT$LAYOUT.withName("send_event"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_POINTER$LAYOUT.withName("display"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("owner"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("requestor"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("selection"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("target"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("property"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("time")
        ).withName("xselectionrequest"),
        MemoryLayout.structLayout(
            Constants$root.C_INT$LAYOUT.withName("type"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_LONG_LONG$LAYOUT.withName("serial"),
            Constants$root.C_INT$LAYOUT.withName("send_event"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_POINTER$LAYOUT.withName("display"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("requestor"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("selection"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("target"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("property"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("time")
        ).withName("xselection"),
        MemoryLayout.structLayout(
            Constants$root.C_INT$LAYOUT.withName("type"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_LONG_LONG$LAYOUT.withName("serial"),
            Constants$root.C_INT$LAYOUT.withName("send_event"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_POINTER$LAYOUT.withName("display"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("window"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("colormap"),
            Constants$root.C_INT$LAYOUT.withName("new"),
            Constants$root.C_INT$LAYOUT.withName("state")
        ).withName("xcolormap"),
        MemoryLayout.structLayout(
            Constants$root.C_INT$LAYOUT.withName("type"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_LONG_LONG$LAYOUT.withName("serial"),
            Constants$root.C_INT$LAYOUT.withName("send_event"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_POINTER$LAYOUT.withName("display"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("window"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("message_type"),
            Constants$root.C_INT$LAYOUT.withName("format"),
            MemoryLayout.paddingLayout(32),
            MemoryLayout.unionLayout(
                MemoryLayout.sequenceLayout(20, Constants$root.C_CHAR$LAYOUT).withName("b"),
                MemoryLayout.sequenceLayout(10, Constants$root.C_SHORT$LAYOUT).withName("s"),
                MemoryLayout.sequenceLayout(5, Constants$root.C_LONG_LONG$LAYOUT).withName("l")
            ).withName("data")
        ).withName("xclient"),
        MemoryLayout.structLayout(
            Constants$root.C_INT$LAYOUT.withName("type"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_LONG_LONG$LAYOUT.withName("serial"),
            Constants$root.C_INT$LAYOUT.withName("send_event"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_POINTER$LAYOUT.withName("display"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("window"),
            Constants$root.C_INT$LAYOUT.withName("request"),
            Constants$root.C_INT$LAYOUT.withName("first_keycode"),
            Constants$root.C_INT$LAYOUT.withName("count"),
            MemoryLayout.paddingLayout(32)
        ).withName("xmapping"),
        MemoryLayout.structLayout(
            Constants$root.C_INT$LAYOUT.withName("type"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_POINTER$LAYOUT.withName("display"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("resourceid"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("serial"),
            Constants$root.C_CHAR$LAYOUT.withName("error_code"),
            Constants$root.C_CHAR$LAYOUT.withName("request_code"),
            Constants$root.C_CHAR$LAYOUT.withName("minor_code"),
            MemoryLayout.paddingLayout(40)
        ).withName("xerror"),
        MemoryLayout.structLayout(
            Constants$root.C_INT$LAYOUT.withName("type"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_LONG_LONG$LAYOUT.withName("serial"),
            Constants$root.C_INT$LAYOUT.withName("send_event"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_POINTER$LAYOUT.withName("display"),
            Constants$root.C_LONG_LONG$LAYOUT.withName("window"),
            MemoryLayout.sequenceLayout(32, Constants$root.C_CHAR$LAYOUT).withName("key_vector")
        ).withName("xkeymap"),
        MemoryLayout.structLayout(
            Constants$root.C_INT$LAYOUT.withName("type"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_LONG_LONG$LAYOUT.withName("serial"),
            Constants$root.C_INT$LAYOUT.withName("send_event"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_POINTER$LAYOUT.withName("display"),
            Constants$root.C_INT$LAYOUT.withName("extension"),
            Constants$root.C_INT$LAYOUT.withName("evtype")
        ).withName("xgeneric"),
        MemoryLayout.structLayout(
            Constants$root.C_INT$LAYOUT.withName("type"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_LONG_LONG$LAYOUT.withName("serial"),
            Constants$root.C_INT$LAYOUT.withName("send_event"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_POINTER$LAYOUT.withName("display"),
            Constants$root.C_INT$LAYOUT.withName("extension"),
            Constants$root.C_INT$LAYOUT.withName("evtype"),
            Constants$root.C_INT$LAYOUT.withName("cookie"),
            MemoryLayout.paddingLayout(32),
            Constants$root.C_POINTER$LAYOUT.withName("data")
        ).withName("xcookie"),
        MemoryLayout.sequenceLayout(24, Constants$root.C_LONG_LONG$LAYOUT).withName("pad")
    ).withName("_XEvent");
    public static MemoryLayout $LAYOUT() {
        return _XEvent.$union$LAYOUT;
    }
    static final VarHandle type$VH = $union$LAYOUT.varHandle(MemoryLayout.PathElement.groupElement("type"));
    public static VarHandle type$VH() {
        return _XEvent.type$VH;
    }
    /**
     * Getter for field:
     * {@snippet :
     * int type;
     * }
     */
    public static int type$get(MemorySegment seg) {
        return (int)_XEvent.type$VH.get(seg);
    }
    /**
     * Setter for field:
     * {@snippet :
     * int type;
     * }
     */
    public static void type$set(MemorySegment seg, int x) {
        _XEvent.type$VH.set(seg, x);
    }
    public static int type$get(MemorySegment seg, long index) {
