// Generated by jextract

package tech.bitey.golpanama.xlib;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct _XExtData {
 *     int number;
 *     struct _XExtData *next;
 *     int (*free_private)(struct _XExtData *);
 *     XPointer private_data;
 * }
 * }
 */
public class _XExtData {

    _XExtData() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        Xlib_h.C_INT.withName("number"),
        MemoryLayout.paddingLayout(4),
        Xlib_h.C_POINTER.withName("next"),
        Xlib_h.C_POINTER.withName("free_private"),
        Xlib_h.C_POINTER.withName("private_data")
    ).withName("_XExtData");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfInt number$LAYOUT = (OfInt)$LAYOUT.select(groupElement("number"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int number
     * }
     */
    public static final OfInt number$layout() {
        return number$LAYOUT;
    }

    private static final long number$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int number
     * }
     */
    public static final long number$offset() {
        return number$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int number
     * }
     */
    public static int number(MemorySegment struct) {
        return struct.get(number$LAYOUT, number$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int number
     * }
     */
    public static void number(MemorySegment struct, int fieldValue) {
        struct.set(number$LAYOUT, number$OFFSET, fieldValue);
    }

    private static final AddressLayout next$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("next"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * struct _XExtData *next
     * }
     */
    public static final AddressLayout next$layout() {
        return next$LAYOUT;
    }

    private static final long next$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * struct _XExtData *next
     * }
     */
    public static final long next$offset() {
        return next$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * struct _XExtData *next
     * }
     */
    public static MemorySegment next(MemorySegment struct) {
        return struct.get(next$LAYOUT, next$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * struct _XExtData *next
     * }
     */
    public static void next(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(next$LAYOUT, next$OFFSET, fieldValue);
    }

    /**
     * {@snippet lang=c :
     * int (*free_private)(struct _XExtData *)
     * }
     */
    public class free_private {

        /**
         * The function pointer signature, expressed as a functional interface
         */
        public interface Function {
            int apply(MemorySegment _x0);
        }

        private static final FunctionDescriptor $DESC = FunctionDescriptor.of(
            Xlib_h.C_INT,
            Xlib_h.C_POINTER
        );

        /**
         * The descriptor of this function pointer
         */
        public static FunctionDescriptor descriptor() {
            return $DESC;
        }

        private static final MethodHandle UP$MH = Xlib_h.upcallHandle(free_private.Function.class, "apply", $DESC);

        /**
         * Allocates a new upcall stub, whose implementation is defined by {@code fi}.
         * The lifetime of the returned segment is managed by {@code arena}
         */
        public static MemorySegment allocate(free_private.Function fi, Arena arena) {
            return Linker.nativeLinker().upcallStub(UP$MH.bindTo(fi), $DESC, arena);
        }

        private static final MethodHandle DOWN$MH = Linker.nativeLinker().downcallHandle($DESC);

        /**
         * Invoke the upcall stub {@code funcPtr}, with given parameters
         */
        public static int invoke(MemorySegment funcPtr,MemorySegment _x0) {
            try {
                return (int) DOWN$MH.invokeExact(funcPtr, _x0);
            } catch (Throwable ex$) {
                throw new AssertionError("should not reach here", ex$);
            }
        }
    }

    private static final AddressLayout free_private$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("free_private"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int (*free_private)(struct _XExtData *)
     * }
     */
    public static final AddressLayout free_private$layout() {
        return free_private$LAYOUT;
    }

    private static final long free_private$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int (*free_private)(struct _XExtData *)
     * }
     */
    public static final long free_private$offset() {
        return free_private$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int (*free_private)(struct _XExtData *)
     * }
     */
    public static MemorySegment free_private(MemorySegment struct) {
        return struct.get(free_private$LAYOUT, free_private$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int (*free_private)(struct _XExtData *)
     * }
     */
    public static void free_private(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(free_private$LAYOUT, free_private$OFFSET, fieldValue);
    }

    private static final AddressLayout private_data$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("private_data"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * XPointer private_data
     * }
     */
    public static final AddressLayout private_data$layout() {
        return private_data$LAYOUT;
    }

    private static final long private_data$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * XPointer private_data
     * }
     */
    public static final long private_data$offset() {
        return private_data$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * XPointer private_data
     * }
     */
    public static MemorySegment private_data(MemorySegment struct) {
        return struct.get(private_data$LAYOUT, private_data$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * XPointer private_data
     * }
     */
    public static void private_data(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(private_data$LAYOUT, private_data$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

