// Generated by jextract

package tech.bitey.golpanama.xlib;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$103 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$103() {}
    static final VarHandle const$0 = constants$101.const$5.varHandle(MemoryLayout.PathElement.groupElement("cookie"));
    static final VarHandle const$1 = constants$101.const$5.varHandle(MemoryLayout.PathElement.groupElement("data"));
    static final UnionLayout const$2 = MemoryLayout.unionLayout(
        JAVA_INT.withName("type"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("type"),
            MemoryLayout.paddingLayout(4),
            JAVA_LONG.withName("serial"),
            JAVA_INT.withName("send_event"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("display"),
            JAVA_LONG.withName("window")
        ).withName("xany"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("type"),
            MemoryLayout.paddingLayout(4),
            JAVA_LONG.withName("serial"),
            JAVA_INT.withName("send_event"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("display"),
            JAVA_LONG.withName("window"),
            JAVA_LONG.withName("root"),
            JAVA_LONG.withName("subwindow"),
            JAVA_LONG.withName("time"),
            JAVA_INT.withName("x"),
            JAVA_INT.withName("y"),
            JAVA_INT.withName("x_root"),
            JAVA_INT.withName("y_root"),
            JAVA_INT.withName("state"),
            JAVA_INT.withName("keycode"),
            JAVA_INT.withName("same_screen"),
            MemoryLayout.paddingLayout(4)
        ).withName("xkey"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("type"),
            MemoryLayout.paddingLayout(4),
            JAVA_LONG.withName("serial"),
            JAVA_INT.withName("send_event"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("display"),
            JAVA_LONG.withName("window"),
            JAVA_LONG.withName("root"),
            JAVA_LONG.withName("subwindow"),
            JAVA_LONG.withName("time"),
            JAVA_INT.withName("x"),
            JAVA_INT.withName("y"),
            JAVA_INT.withName("x_root"),
            JAVA_INT.withName("y_root"),
            JAVA_INT.withName("state"),
            JAVA_INT.withName("button"),
            JAVA_INT.withName("same_screen"),
            MemoryLayout.paddingLayout(4)
        ).withName("xbutton"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("type"),
            MemoryLayout.paddingLayout(4),
            JAVA_LONG.withName("serial"),
            JAVA_INT.withName("send_event"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("display"),
            JAVA_LONG.withName("window"),
            JAVA_LONG.withName("root"),
            JAVA_LONG.withName("subwindow"),
            JAVA_LONG.withName("time"),
            JAVA_INT.withName("x"),
            JAVA_INT.withName("y"),
            JAVA_INT.withName("x_root"),
            JAVA_INT.withName("y_root"),
            JAVA_INT.withName("state"),
            JAVA_BYTE.withName("is_hint"),
            MemoryLayout.paddingLayout(3),
            JAVA_INT.withName("same_screen"),
            MemoryLayout.paddingLayout(4)
        ).withName("xmotion"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("type"),
            MemoryLayout.paddingLayout(4),
            JAVA_LONG.withName("serial"),
            JAVA_INT.withName("send_event"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("display"),
            JAVA_LONG.withName("window"),
            JAVA_LONG.withName("root"),
            JAVA_LONG.withName("subwindow"),
            JAVA_LONG.withName("time"),
            JAVA_INT.withName("x"),
            JAVA_INT.withName("y"),
            JAVA_INT.withName("x_root"),
            JAVA_INT.withName("y_root"),
            JAVA_INT.withName("mode"),
            JAVA_INT.withName("detail"),
            JAVA_INT.withName("same_screen"),
            JAVA_INT.withName("focus"),
            JAVA_INT.withName("state"),
            MemoryLayout.paddingLayout(4)
        ).withName("xcrossing"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("type"),
            MemoryLayout.paddingLayout(4),
            JAVA_LONG.withName("serial"),
            JAVA_INT.withName("send_event"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("display"),
            JAVA_LONG.withName("window"),
            JAVA_INT.withName("mode"),
            JAVA_INT.withName("detail")
        ).withName("xfocus"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("type"),
            MemoryLayout.paddingLayout(4),
            JAVA_LONG.withName("serial"),
            JAVA_INT.withName("send_event"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("display"),
            JAVA_LONG.withName("window"),
            JAVA_INT.withName("x"),
            JAVA_INT.withName("y"),
            JAVA_INT.withName("width"),
            JAVA_INT.withName("height"),
            JAVA_INT.withName("count"),
            MemoryLayout.paddingLayout(4)
        ).withName("xexpose"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("type"),
            MemoryLayout.paddingLayout(4),
            JAVA_LONG.withName("serial"),
            JAVA_INT.withName("send_event"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("display"),
            JAVA_LONG.withName("drawable"),
            JAVA_INT.withName("x"),
            JAVA_INT.withName("y"),
            JAVA_INT.withName("width"),
            JAVA_INT.withName("height"),
            JAVA_INT.withName("count"),
            JAVA_INT.withName("major_code"),
            JAVA_INT.withName("minor_code"),
            MemoryLayout.paddingLayout(4)
        ).withName("xgraphicsexpose"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("type"),
            MemoryLayout.paddingLayout(4),
            JAVA_LONG.withName("serial"),
            JAVA_INT.withName("send_event"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("display"),
            JAVA_LONG.withName("drawable"),
            JAVA_INT.withName("major_code"),
            JAVA_INT.withName("minor_code")
        ).withName("xnoexpose"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("type"),
            MemoryLayout.paddingLayout(4),
            JAVA_LONG.withName("serial"),
            JAVA_INT.withName("send_event"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("display"),
            JAVA_LONG.withName("window"),
            JAVA_INT.withName("state"),
            MemoryLayout.paddingLayout(4)
        ).withName("xvisibility"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("type"),
            MemoryLayout.paddingLayout(4),
            JAVA_LONG.withName("serial"),
            JAVA_INT.withName("send_event"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("display"),
            JAVA_LONG.withName("parent"),
            JAVA_LONG.withName("window"),
            JAVA_INT.withName("x"),
            JAVA_INT.withName("y"),
            JAVA_INT.withName("width"),
            JAVA_INT.withName("height"),
            JAVA_INT.withName("border_width"),
            JAVA_INT.withName("override_redirect")
        ).withName("xcreatewindow"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("type"),
            MemoryLayout.paddingLayout(4),
            JAVA_LONG.withName("serial"),
            JAVA_INT.withName("send_event"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("display"),
            JAVA_LONG.withName("event"),
            JAVA_LONG.withName("window")
        ).withName("xdestroywindow"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("type"),
            MemoryLayout.paddingLayout(4),
            JAVA_LONG.withName("serial"),
            JAVA_INT.withName("send_event"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("display"),
            JAVA_LONG.withName("event"),
            JAVA_LONG.withName("window"),
            JAVA_INT.withName("from_configure"),
            MemoryLayout.paddingLayout(4)
        ).withName("xunmap"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("type"),
            MemoryLayout.paddingLayout(4),
            JAVA_LONG.withName("serial"),
            JAVA_INT.withName("send_event"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("display"),
            JAVA_LONG.withName("event"),
            JAVA_LONG.withName("window"),
            JAVA_INT.withName("override_redirect"),
            MemoryLayout.paddingLayout(4)
        ).withName("xmap"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("type"),
            MemoryLayout.paddingLayout(4),
            JAVA_LONG.withName("serial"),
            JAVA_INT.withName("send_event"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("display"),
            JAVA_LONG.withName("parent"),
            JAVA_LONG.withName("window")
        ).withName("xmaprequest"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("type"),
            MemoryLayout.paddingLayout(4),
            JAVA_LONG.withName("serial"),
            JAVA_INT.withName("send_event"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("display"),
            JAVA_LONG.withName("event"),
            JAVA_LONG.withName("window"),
            JAVA_LONG.withName("parent"),
            JAVA_INT.withName("x"),
            JAVA_INT.withName("y"),
            JAVA_INT.withName("override_redirect"),
            MemoryLayout.paddingLayout(4)
        ).withName("xreparent"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("type"),
            MemoryLayout.paddingLayout(4),
            JAVA_LONG.withName("serial"),
            JAVA_INT.withName("send_event"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("display"),
            JAVA_LONG.withName("event"),
            JAVA_LONG.withName("window"),
            JAVA_INT.withName("x"),
            JAVA_INT.withName("y"),
            JAVA_INT.withName("width"),
            JAVA_INT.withName("height"),
            JAVA_INT.withName("border_width"),
            MemoryLayout.paddingLayout(4),
            JAVA_LONG.withName("above"),
            JAVA_INT.withName("override_redirect"),
            MemoryLayout.paddingLayout(4)
        ).withName("xconfigure"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("type"),
            MemoryLayout.paddingLayout(4),
            JAVA_LONG.withName("serial"),
            JAVA_INT.withName("send_event"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("display"),
            JAVA_LONG.withName("event"),
            JAVA_LONG.withName("window"),
            JAVA_INT.withName("x"),
            JAVA_INT.withName("y")
        ).withName("xgravity"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("type"),
            MemoryLayout.paddingLayout(4),
            JAVA_LONG.withName("serial"),
            JAVA_INT.withName("send_event"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("display"),
            JAVA_LONG.withName("window"),
            JAVA_INT.withName("width"),
            JAVA_INT.withName("height")
        ).withName("xresizerequest"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("type"),
            MemoryLayout.paddingLayout(4),
            JAVA_LONG.withName("serial"),
            JAVA_INT.withName("send_event"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("display"),
            JAVA_LONG.withName("parent"),
            JAVA_LONG.withName("window"),
            JAVA_INT.withName("x"),
            JAVA_INT.withName("y"),
            JAVA_INT.withName("width"),
            JAVA_INT.withName("height"),
            JAVA_INT.withName("border_width"),
            MemoryLayout.paddingLayout(4),
            JAVA_LONG.withName("above"),
            JAVA_INT.withName("detail"),
            MemoryLayout.paddingLayout(4),
            JAVA_LONG.withName("value_mask")
        ).withName("xconfigurerequest"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("type"),
            MemoryLayout.paddingLayout(4),
            JAVA_LONG.withName("serial"),
            JAVA_INT.withName("send_event"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("display"),
            JAVA_LONG.withName("event"),
            JAVA_LONG.withName("window"),
            JAVA_INT.withName("place"),
            MemoryLayout.paddingLayout(4)
        ).withName("xcirculate"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("type"),
            MemoryLayout.paddingLayout(4),
            JAVA_LONG.withName("serial"),
            JAVA_INT.withName("send_event"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("display"),
            JAVA_LONG.withName("parent"),
            JAVA_LONG.withName("window"),
            JAVA_INT.withName("place"),
            MemoryLayout.paddingLayout(4)
        ).withName("xcirculaterequest"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("type"),
            MemoryLayout.paddingLayout(4),
            JAVA_LONG.withName("serial"),
            JAVA_INT.withName("send_event"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("display"),
            JAVA_LONG.withName("window"),
            JAVA_LONG.withName("atom"),
            JAVA_LONG.withName("time"),
            JAVA_INT.withName("state"),
            MemoryLayout.paddingLayout(4)
        ).withName("xproperty"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("type"),
            MemoryLayout.paddingLayout(4),
            JAVA_LONG.withName("serial"),
            JAVA_INT.withName("send_event"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("display"),
            JAVA_LONG.withName("window"),
            JAVA_LONG.withName("selection"),
            JAVA_LONG.withName("time")
        ).withName("xselectionclear"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("type"),
            MemoryLayout.paddingLayout(4),
            JAVA_LONG.withName("serial"),
            JAVA_INT.withName("send_event"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("display"),
            JAVA_LONG.withName("owner"),
            JAVA_LONG.withName("requestor"),
            JAVA_LONG.withName("selection"),
            JAVA_LONG.withName("target"),
            JAVA_LONG.withName("property"),
            JAVA_LONG.withName("time")
        ).withName("xselectionrequest"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("type"),
            MemoryLayout.paddingLayout(4),
            JAVA_LONG.withName("serial"),
            JAVA_INT.withName("send_event"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("display"),
            JAVA_LONG.withName("requestor"),
            JAVA_LONG.withName("selection"),
            JAVA_LONG.withName("target"),
            JAVA_LONG.withName("property"),
            JAVA_LONG.withName("time")
        ).withName("xselection"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("type"),
            MemoryLayout.paddingLayout(4),
            JAVA_LONG.withName("serial"),
            JAVA_INT.withName("send_event"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("display"),
            JAVA_LONG.withName("window"),
            JAVA_LONG.withName("colormap"),
            JAVA_INT.withName("new"),
            JAVA_INT.withName("state")
        ).withName("xcolormap"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("type"),
            MemoryLayout.paddingLayout(4),
            JAVA_LONG.withName("serial"),
            JAVA_INT.withName("send_event"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("display"),
            JAVA_LONG.withName("window"),
            JAVA_LONG.withName("message_type"),
            JAVA_INT.withName("format"),
            MemoryLayout.paddingLayout(4),
            MemoryLayout.unionLayout(
                MemoryLayout.sequenceLayout(20, JAVA_BYTE).withName("b"),
                MemoryLayout.sequenceLayout(10, JAVA_SHORT).withName("s"),
                MemoryLayout.sequenceLayout(5, JAVA_LONG).withName("l")
            ).withName("data")
        ).withName("xclient"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("type"),
            MemoryLayout.paddingLayout(4),
            JAVA_LONG.withName("serial"),
            JAVA_INT.withName("send_event"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("display"),
            JAVA_LONG.withName("window"),
            JAVA_INT.withName("request"),
            JAVA_INT.withName("first_keycode"),
            JAVA_INT.withName("count"),
            MemoryLayout.paddingLayout(4)
        ).withName("xmapping"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("type"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("display"),
            JAVA_LONG.withName("resourceid"),
            JAVA_LONG.withName("serial"),
            JAVA_BYTE.withName("error_code"),
            JAVA_BYTE.withName("request_code"),
            JAVA_BYTE.withName("minor_code"),
            MemoryLayout.paddingLayout(5)
        ).withName("xerror"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("type"),
            MemoryLayout.paddingLayout(4),
            JAVA_LONG.withName("serial"),
            JAVA_INT.withName("send_event"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("display"),
            JAVA_LONG.withName("window"),
            MemoryLayout.sequenceLayout(32, JAVA_BYTE).withName("key_vector")
        ).withName("xkeymap"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("type"),
            MemoryLayout.paddingLayout(4),
            JAVA_LONG.withName("serial"),
            JAVA_INT.withName("send_event"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("display"),
            JAVA_INT.withName("extension"),
            JAVA_INT.withName("evtype")
        ).withName("xgeneric"),
        MemoryLayout.structLayout(
            JAVA_INT.withName("type"),
            MemoryLayout.paddingLayout(4),
            JAVA_LONG.withName("serial"),
            JAVA_INT.withName("send_event"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("display"),
            JAVA_INT.withName("extension"),
            JAVA_INT.withName("evtype"),
            JAVA_INT.withName("cookie"),
            MemoryLayout.paddingLayout(4),
            RuntimeHelper.POINTER.withName("data")
        ).withName("xcookie"),
        MemoryLayout.sequenceLayout(24, JAVA_LONG).withName("pad")
    ).withName("_XEvent");
    static final VarHandle const$3 = constants$103.const$2.varHandle(MemoryLayout.PathElement.groupElement("type"));
    static final StructLayout const$4 = MemoryLayout.structLayout(
        JAVA_SHORT.withName("lbearing"),
        JAVA_SHORT.withName("rbearing"),
        JAVA_SHORT.withName("width"),
        JAVA_SHORT.withName("ascent"),
        JAVA_SHORT.withName("descent"),
        JAVA_SHORT.withName("attributes")
    ).withName("");
    static final VarHandle const$5 = constants$103.const$4.varHandle(MemoryLayout.PathElement.groupElement("lbearing"));
}


